In [1]:
import pandas as pd
import numpy as np

s = pd.Series([1,2,4,123])
s

0      1
1      2
2      4
3    123
dtype: int64

In [2]:
datalist = np.array([2,12,223,3])
print('len= '+str(len(datalist)))
s = pd.Series(datalist)
s
print('s[2]='+str(s[2]))
print(s[1])

len= 4
s[2]=223
12

In [3]:
p = pd.Series(datalist,index = [100,101,102,105])
p

100      2
101     12
102    223
105      3
dtype: int64

In [4]:
data2 = 5
da2 = pd.Series(data2, index = [1, 3, 4])
da2

1    5
3    5
4    5
dtype: int64

In [5]:
data1 = {'a':2,'b':44,'c':2,'3':88}
dal = pd.Series(data1, index = ['a','3','d','c'])
print(dal['3'])
print(dal[:4])
dal

88.0
a     2.0
3    88.0
d     NaN
c     2.0
dtype: float64

a     2.0
3    88.0
d     NaN
c     2.0
dtype: float64

## DataFrame

In [6]:
f1 = pd.DataFrame()
print(f1)
f1

Empty DataFrame
Columns: []
Index: []

Empty DataFrame
Columns: []
Index: []

In [7]:
list1 = [1,23,33,4,3]
f2 = pd.DataFrame(list1)
f2

    0
0   1
1  23
2  33
3   4
4   3

In [8]:
print(f2)

    0
0   1
1  23
2  33
3   4
4   3

In [9]:
list3 = [["liu",2],['sun',8],['bule','jun']]
f3 = pd.DataFrame(list3)
f3

      0    1
0   liu    2
1   sun    8
2  bule  jun

## 字典

In [10]:
list4 = [{'liu':'kk','jun':'as'},{'liu':'bb','jun':'ss','hell':'kk9'}]
list4

[{'liu': 'kk', 'jun': 'as'}, {'liu': 'bb', 'jun': 'ss', 'hell': 'kk9'}]

In [11]:
f5 = pd.DataFrame(list4)
f5

  hell jun liu
0  NaN  as  kk
1  kk9  ss  bb

In [12]:
f6 = pd.DataFrame(list4,index = ['fies','sec'])
f6['jun']

fies    as
sec     ss
Name: jun, dtype: object

In [13]:
f7 = pd.DataFrame(list4, index = ['no1','no2'], columns = ['liu', 'jun'])
f7

    liu jun
no1  kk  as
no2  bb  ss

# 字典的系列可以传递以形成一个DataFrame。 所得到的索引是通过的所有系列索引的并集。

In [14]:
list18 = {'one':pd.Series([1,3,2,],index=['ll','kk','jj']), 'two':pd.Series([33,23,22],index=['ll','kk','bb'])}
f8 = pd.DataFrame(list18)
f8

    one   two
bb  NaN  22.0
jj  2.0   NaN
kk  3.0  23.0
ll  1.0  33.0

# 列选择

In [15]:
f8['one']

bb    NaN
jj    2.0
kk    3.0
ll    1.0
Name: one, dtype: float64

In [16]:
f8['one'].tolist()

[nan, 2.0, 3.0, 1.0]

## 列添加

In [17]:
f8['three'] = pd.Series(['99','990','88'],index = ['ll','kk','bb'])
f8

    one   two three
bb  NaN  22.0    88
jj  2.0   NaN   NaN
kk  3.0  23.0   990
ll  1.0  33.0    99

# 列删除

In [18]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
unsorted_df

       col2      col1
1 -0.850534 -0.317995
4 -0.642354  0.398389
6  1.019860 -2.520462
2 -2.149358 -0.343318
3  0.321593 -0.305958
5  0.868437 -0.703043
9  1.179444 -1.911782
8  1.074312 -0.085372
0 -0.447011  0.776384
7  0.021842  1.376501

In [19]:
sort_df = unsorted_df.sort_index()
sort_df

       col2      col1
0 -0.447011  0.776384
1 -0.850534 -0.317995
2 -2.149358 -0.343318
3  0.321593 -0.305958
4 -0.642354  0.398389
5  0.868437 -0.703043
6  1.019860 -2.520462
7  0.021842  1.376501
8  1.074312 -0.085372
9  1.179444 -1.911782

In [20]:
sort_udf = unsorted_df.sort_index (ascending = False)
sort_udf

       col2      col1
9  1.179444 -1.911782
8  1.074312 -0.085372
7  0.021842  1.376501
6  1.019860 -2.520462
5  0.868437 -0.703043
4 -0.642354  0.398389
3  0.321593 -0.305958
2 -2.149358 -0.343318
1 -0.850534 -0.317995
0 -0.447011  0.776384

In [21]:
kk = unsorted_df.sort_index(axis = 1)
kk

       col1      col2
1 -0.317995 -0.850534
4  0.398389 -0.642354
6 -2.520462  1.019860
2 -0.343318 -2.149358
3 -0.305958  0.321593
5 -0.703043  0.868437
9 -1.911782  1.179444
8 -0.085372  1.074312
0  0.776384 -0.447011
7  1.376501  0.021842

In [22]:
kk1 = kk.sort_values(by = 'col1')
kk1

       col1      col2
6 -2.520462  1.019860
9 -1.911782  1.179444
5 -0.703043  0.868437
2 -0.343318 -2.149358
1 -0.317995 -0.850534
3 -0.305958  0.321593
8 -0.085372  1.074312
4  0.398389 -0.642354
0  0.776384 -0.447011
7  1.376501  0.021842

In [23]:
kk2 = kk.sort_values(by = ['col1','col2'])
kk2

       col1      col2
6 -2.520462  1.019860
9 -1.911782  1.179444
5 -0.703043  0.868437
2 -0.343318 -2.149358
1 -0.317995 -0.850534
3 -0.305958  0.321593
8 -0.085372  1.074312
4  0.398389 -0.642354
0  0.776384 -0.447011
7  1.376501  0.021842

In [24]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],          
        'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
kk3 = pd.DataFrame(ipl_data)
kk3

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [25]:
kk3.groupby('Team')

In [26]:
kk4 =kk3.groupby('Team').groups
kk4

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [27]:
kk5 = kk3.groupby(['Team','Year']).groups
kk5

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

# format

In [28]:
print('{},{}'.format('liu','jun'))

liu,jun

In [29]:
print('{0}{1}'.format('liu','jun'))

liujun

In [30]:
print('{1},{0},{1}'.format('liu','jun'))

jun,liu,jun

In [31]:
print('{name},{age}'.format(name='liu',age=18))

liu,18

In [32]:
list1=['ni','hao','21']
ss = 'wold ssi {}'.format(list1)
ss

"wold ssi ['ni', 'hao', '21']"

In [33]:
b_dict={"name":'liu', "sex":'nan'}
kk = 'wold shift {name},sex is {sex}'.format(**b_dict)
kk

'wold shift liu,sex is nan'

In [34]:
listkk= ['12',"nin",'hao']
s1 = ','.join(listkk)
s1

'12,nin,hao'

In [35]:
s2 = ','.join("'"+x+"'" for x in listkk)
s2

"'12','nin','hao'"

In [36]:
from numpy import nan as NaN
df1=pd.DataFrame([[1,2,3],[NaN,NaN,2],[NaN,NaN,NaN],[8,8,NaN]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

In [37]:
df1.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  0.0  0.0  2.0
2  0.0  0.0  0.0
3  8.0  8.0  0.0

In [38]:
import numpy as np
df=pd.DataFrame(np.arange(16).reshape((4,4)),index=list(range(4)),columns=['a','b','c','d'])

In [39]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [40]:
df.loc[1:3,['b','c']]

    b   c
1   5   6
2   9  10
3  13  14

In [41]:
df['b']

0     1
1     5
2     9
3    13
Name: b, dtype: int64

In [42]:
df[0:2]

   a  b  c  d
0  0  1  2  3
1  4  5  6  7

In [43]:
df.loc[df.loc[:,'a']>1]

    a   b   c   d
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [44]:
df.d

0     3
1     7
2    11
3    15
Name: d, dtype: int64

In [45]:
size_list = ['a','b','c','d']

for i in size_list:
    print(df.loc[df[i],i])

0     0.0
4     NaN
8     NaN
12    NaN
Name: a, dtype: float64
1     5.0
5     NaN
9     NaN
13    NaN
Name: b, dtype: float64
2     10.0
6      NaN
10     NaN
14     NaN
Name: c, dtype: float64
3     15.0
7      NaN
11     NaN
15     NaN
Name: d, dtype: float64

/Users/liujun/anaconda3/envs/python3.6/lib/python3.6/site-packages/pandas/core/indexing.py:1017: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return getattr(section, self.name)[new_key]

In [46]:
for i in size_list:
    df.loc[df[i]<3,i] =0
    df.loc[df[i]>5,i] =1
df

   a  b  c  d
0  0  0  0  3
1  4  5  1  1
2  1  1  1  1
3  1  1  1  1

In [47]:
fs11 = pd.DataFrame([[21, 1.0,3.0,1],
                   [31, 4.0,5.0,2],
                   [21, 4.0,5.0,-3],
                   [5, 0.0,6.0,4]],

columns = list('ABCD'))
fs11

    A    B    C  D
0  21  1.0  3.0  1
1  31  4.0  5.0  2
2  21  4.0  5.0 -3
3   5  0.0  6.0  4

In [48]:
fs11.cumsum(axis=1)

      A     B     C     D
0  21.0  22.0  25.0  26.0
1  31.0  35.0  40.0  42.0
2  21.0  25.0  30.0  27.0
3   5.0   5.0  11.0  15.0

In [49]:
fs11['max'] = fs11['A']+fs11['B']
fs11

    A    B    C  D   max
0  21  1.0  3.0  1  22.0
1  31  4.0  5.0  2  35.0
2  21  4.0  5.0 -3  25.0
3   5  0.0  6.0  4   5.0

In [50]:

fs11['sum'] = fs11['D'].cumsum()
fs11

    A    B    C  D   max  sum
0  21  1.0  3.0  1  22.0    1
1  31  4.0  5.0  2  35.0    3
2  21  4.0  5.0 -3  25.0    0
3   5  0.0  6.0  4   5.0    4

In [51]:
import numpy as np

df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','z'], columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
a  0.619167 -0.263735  1.449019  0.986110
b  0.085275  1.594077  1.377299  0.248592
c -1.560427 -0.383069 -1.252500  1.630014
d -1.851889 -0.311063 -0.997917  0.167246
e  0.714479  0.661529 -1.988422  1.338227
f -0.551934  0.549607  1.303185  0.742001
g -0.435343  0.014518 -0.190349 -0.438041
z  1.394289 -1.100981 -0.581831  0.279046

In [52]:
df['A']

a    0.619167
b    0.085275
c   -1.560427
d   -1.851889
e    0.714479
f   -0.551934
g   -0.435343
z    1.394289
Name: A, dtype: float64

In [53]:
df.loc[:,['A','D']]

          A         D
a  0.619167  0.986110
b  0.085275  0.248592
c -1.560427  1.630014
d -1.851889  0.167246
e  0.714479  1.338227
f -0.551934  0.742001
g -0.435343 -0.438041
z  1.394289  0.279046

In [54]:
df.loc[df['D']<0, 'D'] = 0
df

          A         B         C         D
a  0.619167 -0.263735  1.449019  0.986110
b  0.085275  1.594077  1.377299  0.248592
c -1.560427 -0.383069 -1.252500  1.630014
d -1.851889 -0.311063 -0.997917  0.167246
e  0.714479  0.661529 -1.988422  1.338227
f -0.551934  0.549607  1.303185  0.742001
g -0.435343  0.014518 -0.190349  0.000000
z  1.394289 -1.100981 -0.581831  0.279046

In [55]:
df.loc[['a','e'],['A','D']]

          A         D
a  0.619167  0.986110
e  0.714479  1.338227

In [56]:
df.loc['a':'e',['A','D']]

          A         D
a  0.619167  0.986110
b  0.085275  0.248592
c -1.560427  1.630014
d -1.851889  0.167246
e  0.714479  1.338227

In [57]:
df.loc['a':'e']

          A         B         C         D
a  0.619167 -0.263735  1.449019  0.986110
b  0.085275  1.594077  1.377299  0.248592
c -1.560427 -0.383069 -1.252500  1.630014
d -1.851889 -0.311063 -0.997917  0.167246
e  0.714479  0.661529 -1.988422  1.338227

# loc 两个是参数，前面一个是判断条件，缺失的时候，考虑那个是默认的. 第一个参数是行或者判断条件，第一个参数是列，缺失的情况下 默认是所有

In [58]:
df.loc['a']

A    0.619167
B   -0.263735
C    1.449019
D    0.986110
Name: a, dtype: float64

In [59]:
df.loc[:,'A']

a    0.619167
b    0.085275
c   -1.560427
d   -1.851889
e    0.714479
f   -0.551934
g   -0.435343
z    1.394289
Name: A, dtype: float64

# 第一个参数是条件：列A 所有大于0的数，第二个参数是对应的列

In [60]:
df.loc[df['A']>0,'A']=0

In [61]:
df

          A         B         C         D
a  0.000000 -0.263735  1.449019  0.986110
b  0.000000  1.594077  1.377299  0.248592
c -1.560427 -0.383069 -1.252500  1.630014
d -1.851889 -0.311063 -0.997917  0.167246
e  0.000000  0.661529 -1.988422  1.338227
f -0.551934  0.549607  1.303185  0.742001
g -0.435343  0.014518 -0.190349  0.000000
z  0.000000 -1.100981 -0.581831  0.279046

In [62]:
df['sumCD'] = df['C']+df['D']
df

          A         B         C         D     sumCD
a  0.000000 -0.263735  1.449019  0.986110  2.435129
b  0.000000  1.594077  1.377299  0.248592  1.625891
c -1.560427 -0.383069 -1.252500  1.630014  0.377515
d -1.851889 -0.311063 -0.997917  0.167246 -0.830671
e  0.000000  0.661529 -1.988422  1.338227 -0.650195
f -0.551934  0.549607  1.303185  0.742001  2.045186
g -0.435343  0.014518 -0.190349  0.000000 -0.190349
z  0.000000 -1.100981 -0.581831  0.279046 -0.302785

In [63]:
df['test'] = df['A'].sum()
df

          A         B         C         D     sumCD      test
a  0.000000 -0.263735  1.449019  0.986110  2.435129 -4.399594
b  0.000000  1.594077  1.377299  0.248592  1.625891 -4.399594
c -1.560427 -0.383069 -1.252500  1.630014  0.377515 -4.399594
d -1.851889 -0.311063 -0.997917  0.167246 -0.830671 -4.399594
e  0.000000  0.661529 -1.988422  1.338227 -0.650195 -4.399594
f -0.551934  0.549607  1.303185  0.742001  2.045186 -4.399594
g -0.435343  0.014518 -0.190349  0.000000 -0.190349 -4.399594
z  0.000000 -1.100981 -0.581831  0.279046 -0.302785 -4.399594

In [64]:
sale_data = {'prod_id': ['1101', '1101', '1107', '1107', '11071',
         '1102', '11022', '2200', '3300', '999', '44', '66'],
         'size_id': [12, 12, 233, 233, 21,888 ,888,144,277 , 477,177,2888],
         'Year': [2014-1,2015-3,2014-3,2015-9,2014-1,2015,2016,2017,2016,2014,2015,2017],          
        'qty':[8,79,863,73,1,0,756,0,64,7,8,6]}
sale_data = pd.DataFrame(sale_data)

In [65]:
sale_data

   prod_id  size_id  Year  qty
0     1101       12  2013    8
1     1101       12  2012   79
2     1107      233  2011  863
3     1107      233  2006   73
4    11071       21  2013    1
5     1102      888  2015    0
6    11022      888  2016  756
7     2200      144  2017    0
8     3300      277  2016   64
9      999      477  2014    7
10      44      177  2015    8
11      66     2888  2017    6

In [66]:
sale_data.set_index(['prod_id','size_id'],inplace = True)

In [67]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [68]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [69]:
sale_data_1 = sale_data['qty'].sum(level = ['prod_id','size_id']).reset_index().rename(columns = {'qty':'sumaa'})
sale_data_1

lll = sale_data_1.set_index(['prod_id','size_id']).reset_index(['prod_id','size_id'])

In [70]:
sale_data_1

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [71]:
lll

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [72]:
lll.reset_index()
lll

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [73]:
sale_data['Year']

prod_id  size_id
1101     12         2013
         12         2012
1107     233        2011
         233        2006
11071    21         2013
1102     888        2015
11022    888        2016
2200     144        2017
3300     277        2016
999      477        2014
44       177        2015
66       2888       2017
Name: Year, dtype: int64

In [74]:
pd.to_datetime(sale_data['Year'])

prod_id  size_id
1101     12        1970-01-01 00:00:00.000002013
         12        1970-01-01 00:00:00.000002012
1107     233       1970-01-01 00:00:00.000002011
         233       1970-01-01 00:00:00.000002006
11071    21        1970-01-01 00:00:00.000002013
1102     888       1970-01-01 00:00:00.000002015
11022    888       1970-01-01 00:00:00.000002016
2200     144       1970-01-01 00:00:00.000002017
3300     277       1970-01-01 00:00:00.000002016
999      477       1970-01-01 00:00:00.000002014
44       177       1970-01-01 00:00:00.000002015
66       2888      1970-01-01 00:00:00.000002017
Name: Year, dtype: datetime64[ns]

In [75]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [76]:
salemax = sale_data.groupby(['prod_id','size_id'])
salemax['qty'].max().reset_index().rename(columns={'qty':'max'})

  prod_id  size_id  max
0    1101       12   79
1    1102      888    0
2   11022      888  756
3    1107      233  863
4   11071       21    1
5    2200      144    0
6    3300      277   64
7      44      177    8
8      66     2888    6
9     999      477    7

In [77]:
col_group = ['prod_id','size_id']
salemax = sale_data.groupby(col_group)['qty'].max().reset_index()

In [78]:
salemax

  prod_id  size_id  qty
0    1101       12   79
1    1102      888    0
2   11022      888  756
3    1107      233  863
4   11071       21    1
5    2200      144    0
6    3300      277   64
7      44      177    8
8      66     2888    6
9     999      477    7

In [79]:
salemax.set_index(['prod_id','size_id'],inplace= True)
salemax

                 qty
prod_id size_id
1101    12        79
1102    888        0
11022   888      756
1107    233      863
11071   21         1
2200    144        0
3300    277       64
44      177        8
66      2888       6
999     477        7

In [80]:
salemax.loc[salemax['qty']>0].index

MultiIndex(levels=[['1101', '1102', '11022', '1107', '11071', '2200', '3300', '44', '66', '999'], [12, 21, 144, 177, 233, 277, 477, 888, 2888]],
           codes=[[0, 2, 3, 4, 6, 7, 8, 9], [0, 7, 4, 1, 5, 3, 8, 6]],
           names=['prod_id', 'size_id'])

In [81]:
salemax

                 qty
prod_id size_id
1101    12        79
1102    888        0
11022   888      756
1107    233      863
11071   21         1
2200    144        0
3300    277       64
44      177        8
66      2888       6
999     477        7

In [82]:
qq = salemax.reset_index().groupby(['prod_id','size_id']).count()
qq.columns = ['count']
qq

                 count
prod_id size_id
1101    12           1
1102    888          1
11022   888          1
1107    233          1
11071   21           1
2200    144          1
3300    277          1
44      177          1
66      2888         1
999     477          1

# sort_index()

In [83]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),columns=['c','a','b'],index=['D','B','C','A'])

In [84]:
frame

   c   a   b
D  0   1   2
B  3   4   5
C  6   7   8
A  9  10  11

In [85]:
frame.sort_index(inplace =True)

In [86]:
frame

   c   a   b
A  9  10  11
B  3   4   5
C  6   7   8
D  0   1   2

In [87]:
frame_copy = frame.copy()

In [88]:
frame_copy

   c   a   b
A  9  10  11
B  3   4   5
C  6   7   8
D  0   1   2

In [89]:
frame_copy['col'] = 1
frame_copy.set_index('col', inplace= True)
frame_copy

     c   a   b
col
1    9  10  11
1    3   4   5
1    6   7   8
1    0   1   2

# append

In [90]:
df1 = pd.DataFrame([[1, 2,7,7], [3, 4,8,8]], columns=list('ABCD'))
df1['is'] = 0
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2['is'] =1

In [91]:
df1

   A  B  C  D  is
0  1  2  7  7   0
1  3  4  8  8   0

In [92]:
df2

   A  B  is
0  5  6   1
1  7  8   1

In [93]:
org = df1.append(df2, sort = False)

org

In [94]:
org['col'] =1

In [95]:
org

   A  B    C    D  is  col
0  1  2  7.0  7.0   0    1
1  3  4  8.0  8.0   0    1
0  5  6  NaN  NaN   1    1
1  7  8  NaN  NaN   1    1

In [96]:
org.fillna({'D':0})

   A  B    C    D  is  col
0  1  2  7.0  7.0   0    1
1  3  4  8.0  8.0   0    1
0  5  6  NaN  0.0   1    1
1  7  8  NaN  0.0   1    1

In [97]:
week_no = pd.DataFrame(list(range(-4,0)),columns = ['week_no'])
week_no

   week_no
0       -4
1       -3
2       -2
3       -1

In [98]:
week_no['col_on'] = 1

In [99]:
week_no

   week_no  col_on
0       -4       1
1       -3       1
2       -2       1
3       -1       1

In [100]:
week_no.set_index('col_on',inplace =True)

In [101]:
week_no

        week_no
col_on
1            -4
1            -3
1            -2
1            -1

In [102]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [103]:
qs = sale_data.reset_index().groupby(['prod_id','size_id']).count()

In [104]:
qs

                 Year  qty
prod_id size_id
1101    12          2    2
1102    888         1    1
11022   888         1    1
1107    233         2    2
11071   21          1    1
2200    144         1    1
3300    277         1    1
44      177         1    1
66      2888        1    1
999     477         1    1

# drop

In [105]:
sale_data.drop(['Year'],axis=1)

                 qty
prod_id size_id
1101    12         8
        12        79
1107    233      863
        233       73
11071   21         1
1102    888        0
11022   888      756
2200    144        0
3300    277       64
999     477        7
44      177        8
66      2888       6

In [106]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [107]:
sale_data.reset_index().drop([4])

   prod_id  size_id  Year  qty
0     1101       12  2013    8
1     1101       12  2012   79
2     1107      233  2011  863
3     1107      233  2006   73
5     1102      888  2015    0
6    11022      888  2016  756
7     2200      144  2017    0
8     3300      277  2016   64
9      999      477  2014    7
10      44      177  2015    8
11      66     2888  2017    6

In [108]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [109]:
sale_copy = sale_data

# 删除列 drop

In [110]:
sale_data.drop(columns = ['qty'],axis = 1,inplace =True)

In [111]:
sale_data

                 Year
prod_id size_id
1101    12       2013
        12       2012
1107    233      2011
        233      2006
11071   21       2013
1102    888      2015
11022   888      2016
2200    144      2017
3300    277      2016
999     477      2014
44      177      2015
66      2888     2017


# rename_axis

In [158]:
sale_data.rename_axis(['A','b'])

            Year
A     b
1101  12    2013
      12    2012
1107  233   2011
      233   2006
11071 21    2013
1102  888   2015
11022 888   2016
2200  144   2017
3300  277   2016
999   477   2014
44    177   2015
66    2888  2017

In [168]:
sale_data.reset_index(inplace = True)

# sum(axis=1)

In [172]:
sale_data['sum'] = sale_data[['size_id','Year']].sum(axis=1)
sale_data

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

# datetime

In [115]:
import datetime as dt

In [116]:
date_dec = dt.datetime.now().date()

In [117]:
date_dec

datetime.date(2019, 4, 8)

In [119]:
date_cut = pd.to_datetime(date_dec - dt.timedelta(days= 7))

In [120]:
date_cut

Timestamp('2019-04-01 00:00:00')


# 时间间隔对象

In [121]:
testtime = dt.timedelta(days = 7)

In [122]:
testtime

datetime.timedelta(7)

In [154]:
kk3 = pd.to_datetime('2030-5-10')
kk3

Timestamp('2030-05-10 00:00:00')

In [155]:
kk3 > date_cut

True

In [173]:
df

          A         B         C         D     sumCD      test
a  0.000000 -0.263735  1.449019  0.986110  2.435129 -4.399594
b  0.000000  1.594077  1.377299  0.248592  1.625891 -4.399594
c -1.560427 -0.383069 -1.252500  1.630014  0.377515 -4.399594
d -1.851889 -0.311063 -0.997917  0.167246 -0.830671 -4.399594
e  0.000000  0.661529 -1.988422  1.338227 -0.650195 -4.399594
f -0.551934  0.549607  1.303185  0.742001  2.045186 -4.399594
g -0.435343  0.014518 -0.190349  0.000000 -0.190349 -4.399594
z  0.000000 -1.100981 -0.581831  0.279046 -0.302785 -4.399594

In [176]:
sale_copy

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

In [181]:
sale_copy.set_index(['prod_id','size_id']).groupby(['prod_id','size_id']).sum()

                 Year   sum
prod_id size_id
1101    12       4025  4049
1102    888      2015  2903
11022   888      2016  2904
1107    233      4017  4483
11071   21       2013  2034
2200    144      2017  2161
3300    277      2016  2293
44      177      2015  2192
66      2888     2017  4905
999     477      2014  2491

In [185]:
sale_copy

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

In [183]:
sale_copy.index.drop_duplicates()

RangeIndex(start=0, stop=12, step=1)

In [224]:
sale_copy['size_id'].max(level = [])

ValueError: No group keys passed!

In [223]:
sale_copy

    col prod_id  size_id  Year   sum
0     1    1101       12  2013  2025
1     1    1101       12  2012  2024
2     1    1107      233  2011  2244
3     1    1107      233  2006  2239
4     1   11071       21  2013  2034
5     1    1102      888  2015  2903
6     1   11022      888  2016  2904
7     1    2200      144  2017  2161
8     1    3300      277  2016  2293
9     1     999      477  2014  2491
10    1      44      177  2015  2192
11    1      66     2888  2017  4905

In [187]:
sale_copy['col']=1

In [189]:
sale_copy_1 = sale_copy

In [219]:
p1 = sale_copy_1.reset_index('col', inplace = True)
p1

KeyError: 'Level col must be same as name (None)'

In [216]:
p = sale_copy.reset_index('col', inplace = True)
p

KeyError: 'Level col must be same as name (None)'

In [213]:
p1.join(p)

AttributeError: 'NoneType' object has no attribute 'join'

In [225]:
sale_copy

    col prod_id  size_id  Year   sum
0     1    1101       12  2013  2025
1     1    1101       12  2012  2024
2     1    1107      233  2011  2244
3     1    1107      233  2006  2239
4     1   11071       21  2013  2034
5     1    1102      888  2015  2903
6     1   11022      888  2016  2904
7     1    2200      144  2017  2161
8     1    3300      277  2016  2293
9     1     999      477  2014  2491
10    1      44      177  2015  2192
11    1      66     2888  2017  4905

In [229]:
import numpy as np
sale_copy['we'] = sale_copy['sum'].map(lambda x: 1/(  1 + np.exp(-10 * (x+1))))

In [230]:
sale_copy

    col prod_id  size_id  Year   sum   we
0     1    1101       12  2013  2025  1.0
1     1    1101       12  2012  2024  1.0
2     1    1107      233  2011  2244  1.0
3     1    1107      233  2006  2239  1.0
4     1   11071       21  2013  2034  1.0
5     1    1102      888  2015  2903  1.0
6     1   11022      888  2016  2904  1.0
7     1    2200      144  2017  2161  1.0
8     1    3300      277  2016  2293  1.0
9     1     999      477  2014  2491  1.0
10    1      44      177  2015  2192  1.0
11    1      66     2888  2017  4905  1.0

In [232]:
x =lambda x: 1/(1 + np.exp(-10 * (x+1)))

In [233]:
x